app/controllers/account_statements_controller.rb

SELECT "account_statements".* FROM "account_statements" WHERE "account_statements"."ledger_id" = $1  [["ledger_id", 2]]
---
  def index
    @account_statements = @ledger.account_statements.all

INSERT INTO "account_statements" ("ledger_id", "account_id", "current_balance", "minimum_payment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ledger_id", 2], ["account_id", 3], ["current_balance", 5000.0], ["minimum_payment", 100.0], ["created_at", "2018-04-06 01:05:03.826834"], ["updated_at", "2018-04-06 01:05:03.826834"]]
---
  def create
    @account_statement = @ledger.account_statements.new(account_statement_params)

    respond_to do |format|
      if @account_statement.save

UPDATE "account_statements" SET "current_balance" = $1, "updated_at" = $2 WHERE "account_statements"."id" = $3  [["current_balance", 4000.0], ["updated_at", "2018-04-06 01:52:31.198766"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @account_statement.update(account_statement_params)

DELETE FROM "account_statements" WHERE "account_statements"."id" = $1  [["id", 1]]
---
  def destroy
    @account_statement.destroy

SELECT  "ledgers".* FROM "ledgers" WHERE "ledgers"."user_id" = $1 AND "ledgers"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def set_ledger
    @ledger = current_user.ledgers.find(params[:ledger_id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 2]]
---
  def set_accounts
    @accounts = current_user.accounts.all

SELECT  "account_statements".* FROM "account_statements" WHERE "account_statements"."ledger_id" = $1 AND "account_statements"."id" = $2 LIMIT $3  [["ledger_id", 2], ["id", 1], ["LIMIT", 1]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_account_statement
      @account_statement = @ledger.account_statements.find(params[:id])