app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
---
  def index
    @accounts = current_user.accounts.all

INSERT INTO "accounts" ("name", "description", "interest_rate", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Citi"], ["description", "Fav card"], ["interest_rate", 5.0], ["user_id", 1], ["created_at", "2018-04-05 01:23:57.648365"], ["updated_at", "2018-04-05 01:23:57.648365"]]
---
  def create
    @account = current_user.accounts.build(account_params)

    respond_to do |format|
      if @account.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def set_account
      @account = current_user.accounts.find(params[:id])