app/controllers/ledgers_controller.rb

  def index
    @ledgers = current_user.ledgers.all
---
SELECT "ledgers".* FROM "ledgers" WHERE "ledgers"."user_id" = $1  [["user_id", 2]]

  def create
    @ledger = current_user.ledgers.build(ledger_params)

    respond_to do |format|
      if @ledger.save
---
INSERT INTO "ledgers" ("user_id", "year", "month", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["year", 2018], ["month", 4], ["created_at", "2018-04-05 01:27:23.733777"], ["updated_at", "2018-04-05 01:27:23.733777"]]

    def set_ledger
      @ledger = current_user.ledgers.find(params[:id])
---
SELECT  "ledgers".* FROM "ledgers" WHERE "ledgers"."user_id" = $1 AND "ledgers"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]